import { Container, makeStyles, Typography } from '@material-ui/core';
import MyBreadCrumbs from 'components/GeneralComponents/MyBreadCrumbs';
import { myFontSizes, myFontWeights } from 'components/Styles/Sizes';
import { GAEvent, GAEventAction, GAEventCat } from 'components/Utils/Tracking';
import { UserContext } from 'contexts/MyContext';
import Head from 'next/head';
import React, { useContext, useEffect } from 'react';
import MainComponentContainer from '../src/components/ContainerComponents/MainComponentContainer';
import { GetAllCatagoriesFromMongo, SortOptions } from 'components/Utils/mongodb';
import { AddCategoriesListToData } from 'assets/Database/DatabaseUtils';

const useStyles = makeStyles((theme) => ({
    containerStyle: {
        maxWidth: '85vw',
        [theme.breakpoints.up('md')]: {
            maxWidth: '900px',
        }
    },
    termsBigHeader: {
        marginBottom: '20px',
        fontSize: myFontSizes.TextFontSize22,
        fontWeight: myFontWeights.Weight700Bold,
        textAlign: 'center'
    },
    termsIntro: {
        marginBottom: '20px'
    },
    olStyle: {
        listStylePosition: 'outside',
        marginBottom: '30px'
    },
    liStyleTitle: {
        marginBottom: '10px',
        fontWeight: 'bold'
    },
    liStyle: {
        marginBottom: '10px',
    },
    innerIndent1: {
        marginRight: '25px'
    }
}));

export async function getStaticProps(context) {
    const categories = await GetAllCatagoriesFromMongo(SortOptions.popularity);
    return {
        props: {
            categories: categories,
        },
        revalidate: 1,
    }
}

function Terms(props) {
    const classes = useStyles();
    const { data, storeData } = useContext(UserContext);
    const { categories } = props;

    AddCategoriesListToData(categories, data);

    data.currentCategoryData = "";
    data.articleID = "";
    data.generalPageBreadCrumb = "תקנון אתר ותנאי שימוש"
    data.urlPostFix = "terms"

    let pageTitle = "תקנון אתר ותנאי שימוש - השכרת כלי עבודה";
    let description = "תנאים ותקנון השכרת כלי עבודה - הפרטים הקטנים, מידע חשוב ותקנון השכרת כלי עבודה, ציוד וכלים";

    useEffect(() => {
        storeData(data);
        GAEvent(GAEventCat.TERMS_PAGE, GAEventAction.PAGE_VIEWED);
    });

    return (
        <MainComponentContainer>
            <Head>
                <title>{pageTitle}</title>
                <meta name="description" content={description} />
                <meta name="keywords" content="תנאי השכרת כלי עבודה, תקנון השכרת כלי עבודה, תקנון השכרת כלים, מדיניות פרטיות השכרת כלי עבודה" />
            </Head>
            <MyBreadCrumbs />

            <Typography component="article">

                <Typography component="h2" className={classes.termsBigHeader}>
                    תקנון אתר ומדיניות פרטיות
                </Typography>

                <Container align="right" className={classes.containerStyle}>

                    <Typography component="p" className={classes.termsIntro}>
                        ברוכים הבאים ל Power-Tools השכרת כלי עבודה (להלן: “האתר”). האתר מופעל ע”י אודי כלי עבודה (ע.מ: 052625522) (להלן: “הנהלת האתר” או “החברה”).
                        האתר משמש כאתר סחר אלקטרוני אשר מציע, (בין היתר) למכירה מוצרים שונים (להלן: “המוצרים”)
                    </Typography>

                    <ol className={classes.olStyle}>
                        <li className={classes.liStyleTitle}>
                            כללי
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                האמור בתקנון זה מתייחס באופן שווה לבני שני המינים, והשימוש בלשון זכר הוא מטעמי נוחות בלבד.
                            </li>
                            <li className={classes.liStyle}>
                                הוראות תקנון זה ותנאי השימוש המופיעים באתר מגדירים את מערכת היחסים המשפטית בין המזמין לבין האתר, את תנאי השימוש באתר ו/או
                                את הזמנת המוצרים מן האתר ומעידים על הסכמת המזמין, לתנאים אלה ולתנאים נוספים המופיעים באתר.
                            </li>

                            <li className={classes.liStyle}>
                                החברה רשאית בכל עת, על פי שיקול דעתה הבלעדי, לעדכן תקנון זה.
                            </li>

                            <li className={classes.liStyle}>
                                תנאים אלה חלים על השימוש באתר ובשירותים הכלולים בו באמצעות כל מחשב או מכשיר תקשורת אחר (כדוגמת טלפון סלולארי, טבלטים למיניהם וכו’) כמו כן
                                הם חלים על השימוש באתר, בין באמצעות רשת האינטרנט ובין באמצעות כל רשת או אמצעי תקשורת אחר.
                            </li>

                            <li className={classes.liStyle}>
                                אין באמור בתקנון זה כדי לגרוע מהוראות חוק הגנת הצרכן, התשמ”א-1981 (להלן: “חוק הגנת הצרכן”) והתקנות אשר הותקנו מכוחו, ככל שהן חלות על האתר
                                (להלן: “ההוראות”), למעט במקרים בהם ניתן להתנות על הוראות כאמור והתניה כאמור בוצעה במסגרת האתר אם במפורש ואם במשתמע.
                            </li>

                            <li className={classes.liStyle}>
                                החברה והנהלת האתר עושים כמיטב יכולתם להציג את המידע השלם והמקיף ביותר לגבי המוצר לרבות תמונות, חרף האמור בסעיף זה יובהר, כי עלולים
                                להופיע באתר בתום לב וללא כוונת זדון ו/או מתוך רצון להטעות, אי דיוקים ו/או שגיאות ו/או השמטות והחברה, הנהלת האתר והאתר לא יישאו באחריות כלשהי הנובעת
                                מאי הדיוקים ו/או או השגיאות.
                            </li>

                            <li className={classes.liStyle}>
                                כותרות הפרקים מובאות לשם נוחות והתמצאות המזמין ולא ישמשו בפרשנות התקנון.
                            </li>

                            <li className={classes.liStyle}>
                                טעות סופר בתיאור מוצר/ים לא תחייב את החברה.
                            </li>

                            <li className={classes.liStyle}>
                                תמונות המוצרים באתר מוצגות לצורכי המחשה בלבד. בנוסף, ייתכנו הבדלים במראה, בגוון, בגודל, וכיו”ב בין המוצר, כפי שהוא מוצג באתר, לבין המוצר במציאות.
                            </li>

                            <li className={classes.liStyle}>
                                אין להעתיק ולהשתמש, או לאפשר לאחרים להשתמש, בכל דרך אחרת בתכנים מתוך האתר, לרבות באתרי אינטרנט אחרים, בפרסומים אלקטרוניים,
                                בפרסומי דפוס וכיו”ב, לכל מטרה אחרת.
                            </li>

                            <li className={classes.liStyle}>
                                המועד שנרשם, לכל עניין ועניין, במחשבי החברה הוא המועד הקובע לכל דבר.
                            </li>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            הרשמה לאתר
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                על מנת לבצע הזמנה של מוצרים על המזמין להירשם באתר באמצעות טופס הרשמה מקוון.
                            </li>
                            <li className={classes.liStyle}>
                                כל אדם, לרבות חברה, רשאי להשתמש באתר, לרבות לבצע רכישות באמצעות האתר, בין היתר, בכפוף להיותו כשיר לבצע פעולות משפטיות מחייבות, בעל כרטיס אשראי תקף ,שהונפק ע”י אחת מחברות כרטיסי האשראי (לעיל ולהלן: “המזמין”).
                            </li>

                            <li className={classes.liStyle}>
                                הרישום הינו חד פעמי, כאשר לאחריו המזמין לא יידרש לשוב ולהירשם בכל פעם מחדש בעת ביצוע הרכישה.
                            </li>

                            <li className={classes.liStyle}>
                                בעת הרישום באתר על המזמין להזין שם משתמש וסיסמא וכן את כתובת הדואר האלקטרוני שלו. במידה וישכח המזמין את הסיסמא, תשלח אליו הסיסמא
                                הקיימת כפי שהוזנה בעת הרישום הראשוני באתר לכתובת הדוא”ל אשר הוזנה באתר.
                            </li>

                            <li className={classes.liStyle}>
                                בעתיד אם וכאשר יבקש המזמין לרכוש מוצרים נוספים, יזוהה המזמין לפי שם המזמין והסיסמא שבחר.
                            </li>

                            <li className={classes.liStyle}>
                                פרטי המזמין יעודכנו בהתאם לנתונים אשר ימולאו על ידי המזמין בטופס הרישום המקוון במצוי באתר.
                            </li>

                            <li className={classes.liStyle}>
                                הנהלת האתר רשאית מעת לעת לדרוש פרטי זיהוי נוספים.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            רכישת מוצרים באתר
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                רכישת מוצרים תתבצע ע"י יצירת קשר עם עובדים האתר או באמצעות הוספת מוצרים לסל הקניות, לאחר הוספת מוצרים לסל הקניות יזין המזמין בטופס המקוון המיועד לכך בתהליך
                                ההזמנה את פרטי המזמין הבאים: שם פרטי, שם משפחה, מס’ טלפון, כתובת דואר אלקטרוני, בנוסף יש למסור את פרטי מקבל ההזמנה, שם פרטי,
                                שם משפחה, מס’ טלפון, יישוב, רחוב מס’ בית, קומה, דירה, כניסה וכל פרט מזהה אחר שיש בידיו לסייע למבצע המשלוח לאתר בקלות את הנכס אליו מתבצעת
                                מסירת ההזמנה לרבות הערות ומידע בנוגע לפעולת השילוח ו/או במידה ומקבל ההזמנה אינו בבית. השדות המסומנים בכוכבית קיימת חובה למלאם ובלעדיהם לא תתאפשר השלמת ההזמנה.
                            </li>
                            <li className={classes.liStyle}>
                                על מנת למנוע כל אפשרות של תקלה במשלוח על המזמין למסור רק פרטים מדויקים ונכונים.
                            </li>

                            <li className={classes.liStyle}>
                                בעת פעולת השלמת ההזמנה יאשר המזמין את פרטי ההזמנה ואת נכונות הפרטים שמסר.
                            </li>

                            <li className={classes.liStyle}>
                                מילוי כל הפרטים מהווה תנאי מוקדם לביצוע ההזמנה וזאת לשם ביצוע ההזמנה ביעילות וללא תקלות ועל כן יש להקפיד על מסירת כל הפרטים במדויק.
                            </li>

                            <li className={classes.liStyle}>
                                פרטי המזמין יעודכנו בהתאם לאמור בטופס ההזמנה המקוון באתר.
                            </li>

                            <li className={classes.liStyle}>
                                מסירת כל הפרטים הנדרשים בטלפון לנציג המכירות או מילוי שלהם באתר לרכישת המוצר על ידי המזמין יחשב לביצוע הזמנה (להלן:”ההזמנה”) עם קבלת ההזמנה, האתר יבצע בדיקה של פרטי כרטיס האשראי
                                ורק לאחר אישור חברת האשראי כפי שיובהר להלן, הפעולה תאושר ויצא אישור סופי של ההזמנה, חיוב הלקוח עבור המוצר יבוצע דרך כרטיס האשראי כפי שיבואר להלן והכל בכפוף להימצאות המוצרים במלאי החברה והאתר.
                            </li>

                            <li className={classes.liStyle}>
                                הפרטים כפי שהוזנו בטופס ההזמנה על ידי המזמין, יהוו ראיה חלוטה לנכונות הפעולות.
                            </li>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            אופן ביצוע התשלום עבור ההזמנה
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                התשלום עבור המוצרים יעשה באמצעות כרטיס אשראי או באמצעות חשבון בשירות “ארנק אלקטרוני” כדוגמת פיי פאל וכל שירות דומה, כפי שיהיה זמין לשימוש באתר, מעת לעת לפי שיקול דעתה של הנהלת האתר.
                            </li>
                            <li className={classes.liStyle}>
                                אם יבחר המזמין להשתמש בכרטיס אשראי לשם ביצוע התשלום, יתבקש המזמין למסור את פרטי כרטיס האשראי, תעודת זהות, סוג הכרטיס ותוקפו.
                            </li>

                            <li className={classes.liStyle}>
                                הנהלת האתר שומרת לעצמה את הזכות להפסיק את השימוש באמצעי התשלום כלשהו באתר, להתיר שימוש באמצעי תשלום נוספים ולהחיל הסדרי תשלום שונים על סוגי כרטיסי אשראי שונים או אמצעי תשלום שהנהלת האתר תכבד.
                            </li>

                            <li className={classes.liStyle}>
                                לאחר שהוזנו פרטי התשלום בטופס ההזמנה המקוון, ישלח אל המזמין אישור באמצעות הדואר האלקטרוני על קליטת פרטי ההזמנה. יובהר כי אישור זה אינו מחייב את הנהלת האתר לספק את המוצרים שהוזמנו והוא רק מעיד שפרטי ההזמנה נקלטו בהנהלת האתר.
                            </li>

                            <li className={classes.liStyle}>
                                במקרה בו לא אושרה העסקה על ידי חברת האשראי או על ידי כל אמצעי תשלום אחר שיהיה באותה עת, יקבל המזמין הודעה מתאימה על כך והנהלת האתר תיצור קשר עם המזמין לשם השלמת העסקה או ביטולה.
                            </li>

                            <li className={classes.liStyle}>
                                אישור פעולת הרכישה מותנה בהימצאות המוצר הנרכש במלאי במועד האספקה המבוקש ו/במועד ההזמנה. אם לא צויין, כי המוצר אינו קיים במלאי והמוצר לא הורד מהאתר עד למועד ביצוע ההזמנה, לא תהא הנהלת האתר מחויבת בכפוף לכך שהנהלת האתר תשיב למזמין כל סכום ששולם אם שולם להנהלת האתר ו/או תבטל את החיוב אם בוצע בגין פעולת הרכישה.
                            </li>

                            <li className={classes.liStyle}>
                                יובהר כי יתכנו מצבים בהם על אף שהפריט מוצג באתר כקיים במלאי, בפועל הוא חסר  ולא ניתן לספק אותו, במקרים אלו תבוטל העסקה ולמזמין לא תהה כל טענה בקשר לכך בכפוף להשבת הסכום ששולם על ידי הלקוח.
                            </li>

                            <li className={classes.liStyle}>
                                מועד המשלוח יקבע החל מיום אישור העסקה על ידי חברת האשראי  או שירות ארנק אלקטרוני זמין אחר שאושר.
                            </li>

                            <li className={classes.liStyle}>
                                במידה והמזמין חויב בטעות על ידי חברת האשראי, על המזמין להודיע להנהלת האתר על מנת לבצע זיכוי בהתאם.
                            </li>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            אספקה והובלת המוצרים
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                אספקת המוצר ע”י האתר יעשה רק לאחר קבלת אישור תשלום מאת חברת האשראי, כלומר המוצר שולם, כמפורט לעיל, המוצר יסופק לכתובת שהמזמין הקליד ו/או מסר בעת ביצוע ההזמנה בטופס המקוון.
                            </li>
                            <li className={classes.liStyle}>
                                האתר מתחייב לספק את הסחורה במסגרת זמן האספקה ליעד המבוקש ויעשה כמיטב יכולתו כי המוצר יגיע במהירות.
                            </li>

                            <li className={classes.liStyle}>
                                הנהלת האתר תפעל כמיטב יכולתה לספק את המוצרים במהירות והמוצרים ובתוך 14 ימי עסקים מיום קליטת ההזמנה ואישורה אם נשלח באמצעות דואר רשום ותוך 3 ימי עסקים אם נשלח באמצעות שליח. זמני אספקת המוצרים כוללים רק את חישובם של ימי עסקים (ימי א’ עד ה’, לא כולל ימי שישי, שבת, ערבי חג וימי חג).
                            </li>

                            <li className={classes.liStyle}>
                                המשלוחים שיסופקו באמצעות חברת המשלוחים מטעם הנהלת האתר הינם בהתאם לתנאי חברת המשלוחים, אזורי החלוקה של חברת המשלוחים ובתאום מראש עם מקבל ההזמנה.
                            </li>

                            <li className={classes.liStyle}>
                                במידה ואין ביכולתה של חברת המשלוחים לבצע את המשלוח עד לכתובת המשלוח מכל סיבה שהיא. הנהלת האתר תודיע למזמין ותפעל למציאת פתרון חלופי אשר יענה לרצון שני הצדדים.
                            </li>

                            <li className={classes.liStyle}>
                                במקרים בהם מסופקים המוצרים באמצעות דואר ישראל, לכתובת המשלוח שמסר המזמין בעת ביצוע ההזמנה. המוצרים יישלחו בכפוף לזמן האספקה של דואר ישראל ואינם ניתנים לבקרה ולשליטה על ידי הנהלת האתר ו/או הספקים.
                            </li>

                            <li className={classes.liStyle}>
                                מועדי האספקה המצוינים באתר ולעיל אינם חלים על מוצרים שאזלו מן המלאי של האתר ו/או מן המלאי של הספק הרלוונטי
                            </li>

                            <li className={classes.liStyle}>
                                המשלוחים מבוצעים על ידי חברת שליחויות, באמצעותה תבוצע ההובלה של המוצרים תנאי חברת השליחויות  יחייבו את הלקוח.
                            </li>

                            <li className={classes.liStyle}>
                                דמי המשלוח – בנוסף למחיר המוצרים שהוזמנו, יושת על המזמין תשלום של דמי משלוח, סכום דמי המשלוח יופיע בתום תהליך ההזמנה בהתאם לדרך השילוח אותה בחר המזמין, אלא אם כן צויין אחרת.
                            </li>

                            <li className={classes.liStyle}>
                                דמי המשלוח ישולמו עם התשלום בגין המוצר. במכירה בתשלומים באמצעות בכרטיס אשראי או כל אמצעי תשלום אחר. האתר רשאי לגבות את דמי המשלוח עם חיוב התשלום הראשון.
                            </li>

                            <li className={classes.liStyle}>
                                על הלקוח להודיע מיידית לאתר אם המוצר לא סופק בתקופת האספקה המפורטת באתר, במקרה כזה זמן האספקה החדש ייחשב מיום תיאום מועד חדש.
                            </li>

                            <li className={classes.liStyle}>
                                יש להקפיד למלא פרטים מדויקים ועדכניים, במקרה שהמוצרים יחזרו לחברה בגלל פרטים מוטעים, המזמין יישא בתשלום בגין דמי משלוח וטיפול.
                            </li>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            הרשמה לאתר
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                המזמין רשאי לבטל את העסקה בהתאם להוראות חוק הגנת הצרכן והתקנות שהותקנו על פיו. מבלי לגרוע מהאמור:
                            </li>

                            <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                                <li className={classes.liStyle}>
                                    ביטול ייעשה אך ורק בהודעה בכתב לכתובת הדוא”ל במצויה בתחתית האתר או בדף צור קשר של האתר.
                                </li>

                                <li className={classes.liStyle}>
                                    ביטול עסקה ע”י המזמין לא יתאפשר ברכישת פריטים מסוימים כמפורט בסעיף קטן 14ג(ד) לחוק הגנת הצרכן.
                                </li>

                                <li className={classes.liStyle}>
                                    ביטול העסקה ע”י הלקוח כפוף לכך שהמוצר יוחזר ככל שהדבר סביר או אפשרי באריזתו המקורית.
                                </li>

                                <li className={classes.liStyle}>
                                    לאחר קבלת הודעת הביטול יושב למזמין הסכום ששולם על ידו בגין המוצר בניכוי דמי ביטול (דמי המשלוח אינם חלק ממחיר המוצר ולכן ינוכו בנפרד מההחזר) בשיעור של 5% מסכום העסקה או 100 ש”ח, לפי הנמוך. במקרה של ביטול עסקה עקב פגם או אי התאמה, לא יחויב המזמין בדמי ביטול כלשהם. הוראות חוק הגנת הצרכן נוספות בנוגע לביטול הרכישה מצד המזמין, לרבות בנוגע לחובה להחזיר המוצר, יחולו גם-כן.
                                </li>
                            </ol>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            ביטול רכישה מצד החברה
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                החברה תהא רשאית, על פי שיקול דעתה הבלעדי, בשל כל סיבה, ובכל עת, לבטל או להפסיק עסקה ו/או מכירה ו/או לבטל הזמנה, כולה או חלקה, ו/או את פעילות האתר, כולו או חלקו.
                            </li>
                            <li className={classes.liStyle}>
                                הודעה על ביטול או הפסקה מעין זה תימסר למשתמש או למזמין, והחברה תימנע מחיוב כרטיס האשראי של המזמין או תשיב לו כל סכום ששולם בגין המוצרים, ככל ששולם.
                            </li>

                            <li className={classes.liStyle}>
                                למעט בגין השבת סכום העסקה כאמור, לא תהיה למשתמש או למזמין כל טענה, תביעה ו/או דרישה כלפי החברה ו/או הספק בגין ביטול העסקה כאמור בסעיף זה.
                            </li>

                            <li className={classes.liStyle}>
                                במידה והתגלה כי מוצר אזל מהמלאי, רשאי האתר לבטל את ההזמנה או להציע פריט חלופי שווה ערך. בוטלה הזמנה כאמור האתר לא יהיה אחראי ולא ישא בכל נזק ישיר, עקיף, תוצאתי או מיוחד שנגרם ללקוח או לצד שלישי לרבות אך לא רק נזק בגין רכישת הפריט אצל צד שלישי במחיר גבוה יותר.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            זכויות יוצרים
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                כל זכויות הקניין הרוחני, לרבות פטנטים, זכויות היוצרים, הדגמים, המדגמים והסודות המסחריים, הנם רכושם של החברה בלבד או של צדדים שלישיים אחרים שהרשו להנהלת האתר להשתמש בהם.
                            </li>
                            <li className={classes.liStyle}>
                                זכויות אלה חלות בין השאר על הנתונים באתר, לרבות רשימת המוצרים, תאור ועיצוב המוצרים וכל פרט אחר הקשור להפעלתו.
                            </li>

                            <li className={classes.liStyle}>
                                זכויות אלה חלות גם על שם האתר ושם המתחם (https://www.power-tools.co.il ) של האתר, סימני המסחר (בין אם נרשמו ובין אם לא) הם כולם רכושה של החברה. אין לעשות בהם שימוש בלא קבלת הסכמתה בכתב ומראש.
                            </li>

                            <li className={classes.liStyle}>
                                אין להעתיק, לשכפל, להפיץ, למכור, לשווק, להשכיר ולתרגם מידע כלשהו מהאתר, לרבות סימני מסחר, תמונות וטקסטים, עיצוב המוצרים תמונות המוצרים וכיו”ב בלא קבלת אישור מראש ובכתב של החברה.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            אחריות
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לנזקים הנובעים ו/או הקשורים בכל דרך שהיא, על תיקונם, שימושם, הרכבתם ו/או החלפתם של המוצרים.
                            </li>
                            <li className={classes.liStyle}>
                                החברה (ו/או מי מטעמה) אינה נושאת במישרין או בעקיפין באחריות כלשהי לנזקים הנובעים כתוצאה משימוש ו/או הסתמכות על מידע המתפרסם באתרים חיצוניים, שאליהם ניתן להגיע באמצעות איזה מהשירותים באתר. יובהר כי החברה עושה ותעשה כמיטב יכולתה לשתף פעולה עם ספקים אמינים ובעלי מוניטין בלבד.
                            </li>

                            <li className={classes.liStyle}>
                                החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לנזקים הנובעים ו/או הקשורים בכל דרך שהיא בשימוש ו/או בביצועי האתר.
                            </li>

                            <li className={classes.liStyle}>
                                החברה (ו/או מי מטעמה) אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לנזקים הנובעים ו/או הקשורים בכל דרך שהיא בשימוש במוצרים או בשירותים שנמכרו דרכה.
                            </li>

                            <li className={classes.liStyle}>
                                בכל מקרה החברה לא תישא באחריות לפעילות כלשהי של כל גורם אחר שאינו בשליטתה המלאה.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            סודיות ופרטיות
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                כל פרטיו האישים של המזמין (שם, דואר אלקטרוני וכדומה), יישמרו במאגרי המידע של החברה.
                            </li>
                            <li className={classes.liStyle}>
                                החברה לא תעביר פרטיו האישיים של המזמין לאף גורם אחר זולת לספקים, במידת הצורך וזאת רק לשם השלמת עסקה.
                            </li>

                            <li className={classes.liStyle}>
                                החברה לא תעשה כל שימוש בפרטים של אמצעי התשלום של המזמין אלא לביצוע תשלום בגין עסקה אותה ביקש המזמין לערוך, ופרטים אלו לא יועברו לאף גורם אחר זולת לצורך זה. למען הסר ספק, פרטי אמצעי התשלום אינם נשמרים במאגרי המידע של החברה.
                            </li>

                            <li className={classes.liStyle}>
                                למרות האמור לעיל, החברה תהא רשאית להעביר פרטיו האישיים של משתמש לצד שלישי במקרים בהם המזמין ביצע מעשה או מחדל הפוגעים ו/או העלולים לפגוע בחברה ו/או בצדדים שלישיים כלשהם, המזמין עשה שימוש בשירותי החברה לביצוע מעשה בלתי חוקי, אם התקבל בידי החברה צו שיפוטי המורה לה למסור את פרטי המזמין לצד שלישי וכן בכל מחלוקת או הליכים משפטיים.
                            </li>

                            <li className={classes.liStyle}>
                                החברה תוכל להשתמש בפרטיו האישיים של המזמין, ללא זיהוי המזמין הספציפי, לצורך ניתוח מידע סטטיסטי והצגתו ו/או מסירתו לגורמים אחרים.
                            </li>

                            <li className={classes.liStyle}>
                                מאחר שמדובר בביצוע פעולות בסביבה מקוונת אין באפשרותה של החברה להבטיח חסינות מוחלטת מפני חדירות למחשביה או חשיפת המידע האגור בידי מבצעי פעולות בלתי חוקיות. אם יעלה בידי צד שלישי לחדור למידע אשר שמור בידי החברה ו/או להשתמש בו לרעה, לא תהיה למשתמש כל טענה, תביעה או דרישה כלפי החברה.
                            </li>

                            <li className={classes.liStyle}>
                                החברה תהא רשאית לעשות שימוש ב – “עוגיות” (“cookies”) על מנת לספק למשתמש שירות מהיר ויעיל ולחסוך מהמזמין הצורך להזין את פרטיו האישיים בכל כניסה לאתר.
                            </li>

                            <li className={classes.liStyle}>
                                בקיום מקרים שאינם בשליטתה של החברה ו/או הנובעים מכח עליון, החברה לא תהא אחראית לכל נזק מכל סוג שהוא, עקיף או ישיר, שייגרם למזמין ו/או למי מטעם המזמין עם מידע זה יאבד או אם יעשה בו שימוש לא מורשה.
                            </li>
                        </ol>




                        <li className={classes.liStyleTitle}>
                            דין ושיפוט
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                הדין החל על תקנון זה ו/או על כל פעולה ו/או על סכסוך הנובע ממנו, הוא הדין הישראלי בלבד.
                            </li>
                            <li className={classes.liStyle}>
                                בכל מקרה של מחלוקת, תהא לבתי המשפט (השלום או המחוזי) ירושלים הסמכות הבלעדית לדון בה.
                            </li>

                            <li className={classes.liStyle}>
                                הדין החל על השימוש באתר, על ההזמנה ועל תקנון זה, לרבות פרשנותו ואכיפתו של התקנון הוא הדין הישראלי בלבד.
                            </li>

                        </ol>
                    </ol>


                    <Typography component="h1" className={classes.termsBigHeader}>
                        תקנון השכרת כלי עבודה, ציוד עבודה, וכלי עבודה לבניין
                    </Typography>


                    <Typography component="p" className={classes.termsIntro}>
                        אלה התנאים והתקנון לשירות השכרת כלי עבודה, השכרת ציוד לבנייה, השכרת כלים חשמליים, והשכרה כלי בניין.
                        בהשכרת כלי עבודה או רכישת שירות השכרת כלים הלקוח מסכים לתנאים הרשומים בתקנון זה.
                    </Typography>

                    <ol className={classes.olStyle}>
                        <li className={classes.liStyleTitle}>
                            תנאי יסוד
                        </li>
                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>

                            <li className={classes.liStyle}>
                                ידוע וברור לשוכר כי זמן השכרת הכלי, להלן:מועד קבלת הכלי ועד להחזרתו למשכיר,תהיה בהתאם ללוח הזמנים שנקבע בתנאים אלו.
                            </li>
                            <li className={classes.liStyle}>
                                זמן ההשכרה משמעותו: הזמן שהכלי שהה אצל השוכר מרגע חתימתו על מסמך זה ועד לרגע החזרתו ורישומו המלא בספר ההשכרות.תעריף ההשכרה מחושב ל 24 שעות.
                            </li>

                            <li className={classes.liStyle}>
                                במקרה של איחור של עד שעתיים בהחזרת הכלי: עד שעתיים מהמועד בו היה צריך להחזיר את הכלי יצטרך השוכר לשלם בנוסף לדמי ההשכרה 30% נוספים מתעריף ההשכרה היומי.
                            </li>


                            <li className={classes.liStyle}>
                                במקרה של איחור של למעלה משעתיים בהחזרת הכלי:יצטרך השוכר לשלם בעבור יום השכרה נוסף.
                            </li>

                            <li className={classes.liStyle}>
                                ידוע וברור לשוכר כי החיוב לשכירות כפי שנקבע ע"י המשכיר, לא יהיה מושפע ולא ישתנה בצורה כלשהי גם אם השוכר יטען כי לא עבד או לחילופין לא השתמש ו/או לא סיים את העבודה במכשיר שהיה ברשותו מכל סיבה שהיא. וזאת בכל אחד מימי השבוע ללא יוצא מן הכלל.
                            </li>

                            <li className={classes.liStyle}>
                                במקרה של תקלה או קלקול במכשיר, על השוכר להודיע מיידית על התקלה למשכיר וכן להעביר את המכשיר מידית לתיקון למשכיר. השוכר יקבל כלי חילופי וכמו כן יקבל הארכת זמן של שעתיים נוספות לזמן ההשכרה.
                            </li>

                            <li className={classes.liStyle}>
                                מוסכם על ידי השוכר, כי המשכיר יוכל לגבות ולמשוך תשלום על חשבון ההשכרה מכרטיס האשראי הנמצא כפיקדון, בשלושה מקרים כדלהלן:
                            </li>

                            <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                                <li className={classes.liStyle}>
                                    חלפו שלושה ימים מיום ההשכרה והכלי טרם הוחזר.
                                </li>
                                <li className={classes.liStyle}>
                                    השוכר לא החזיר את הכלי כמוסכם.
                                </li>
                                <li className={classes.liStyle}>
                                    נזק שנגרם לכלי המושכר.
                                </li>
                            </ol>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            תנאי בטיחות
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                השוכר מצהיר בזאת על הכשרתו וכשירותו להשתמש בכלי המושכר וכי הינו מתחייב לנקוט בכל אמצעי הבטיחות הקיימים להבטחת בטיחותו ובטיחות הסובבים אותו וכן ימלא אחר כל ההוראות הבטיחותיות והחוקיות בהפעלה ושימוש בכלי המושכר. אין המשכיר יהיה אחראי לנזק ישיר או עקיף, לרבות נזקים ברכוש או בנפש שיגרמו למפעיל או לזולתו או לסובבים אותו. כל האמור לעיל הוא כללי ביותר. מיומנות ושכל ישר של המשתמש בכלי, הינם הכרחיים לשימוש נכון ומניעת תאונות.
                            </li>
                            <li className={classes.liStyle}>
                                השוכר מצהיר בזאת כי לא ירשה לאף אחד אחר לעבוד עם הכלי, ואם אכן אדם אחר יעבוד עם כלי העבודה השוכר לוקח את מלוא האחריות. אין המשכיר יהיה אחראי לנזק כמפורט בסעיף 2.1 של תנאי הבטיחות, במקרה בו השוכר הרשה לאדם אחר לעבוד עם הכלי מלבדו.
                            </li>
                            <li className={classes.liStyle}>
                                השוכר ימלא אחר כל ההוראות החוקיות בקשר לשימוש בציוד והוא ורק הוא בלבד יהיה אחראי לכל נזק, הפסד, תביעה והוצאות עקב שימוש לא נכון בציוד.
                            </li>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            החזקת ציוד והשימוש בו
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                השוכר יחזיק את הציוד במצב טוב ותקין וישמור עליו מכל פגיעה או נזק, פרט לבלאי רגיל, יישא השוכר בכל הוצאת החזקת הציוד ותיקונו.
                            </li>
                            <li className={classes.liStyle}>
                                בכל מקרה של שבר שנגרם לכלי המושכר או לאביזריו כולל איזמל לפטישי חציבה, מכל סיבה שהיא, ישא השוכר במלוא הנזק.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            החזרת ציוד
                        </li>

                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                בתום תקופת השכירות יחזיר השוכר את הציוד למקום עסקו של המשכיר במצב כפי שקיבל אותו, כשהוא:
                            </li>

                            <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                                <li className={classes.liStyle}>
                                    נקי וללא שום פגמים בהתחשב בבלאי הרגיל.
                                </li>
                                <li className={classes.liStyle}>
                                    יכלול בשלמות את כל החלקים המצורפים שקיבל השוכר בעת ההשכרה.
                                </li>
                            </ol>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            שונות
                        </li>
                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                במקרה של אובדן הציוד מחמת גניבה או כל סיבה אחרת ללא יוצא מן הכלל, תחול על השוכר חובת תשלום ופיצוי למשכיר במלוא ערך הכלי, במחיר המחירון של המשכיר ובנוסף תשלום עבור ימי השכרה עד ליום גמר החשבון.
                            </li>

                            <li className={classes.liStyle}>
                                השוכר משחרר את המשכיר מכל דרישה ותביעת אישום שתוגש בקשר לציוד המושכר בגין התקופה בה היה מושכר וכן מתחייב השוכר לפצות את המשכיר כתוצאה מאי שחרור המושכר כולל נזיקין, הוצאות שכר טרחת עורך דין וכיוצ"ב במידה ויידרש.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            אישור קבלת ציוד והצהרת השוכר
                        </li>
                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                השוכר מאשר בחתימתו שקיבל את הציוד לאחר בדיקה והינו במצב טוב ותקין, ראוי לשימוש ונקי והוא יודע עבור מה הוא מיועד ולמה הוא שימושו ומטרתו. הוא מאשר כי הוא יודע כיצד להשתמש בו ומתחייב לנקוט בכל אמצעי הזהירות והבטיחות המחמירים ביותר. כל נזקי גוף או רכוש שיגרמו עקב שימוש בכלי המושכר על אחריותו של המשכיר בלבד.
                            </li>

                            <li className={classes.liStyle}>
                                השוכר מצהיר בחתימת ידו כי קרא והבין את הכתוב במסמך דלעייל והוא מתחייב לקיימם כלשונם וככתבם.
                            </li>
                        </ol>



                        <li className={classes.liStyleTitle}>
                            הזמנה וביטול השכרת כלי עבודה
                        </li>
                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                במקרה של הזמנת כלי למועד מאוחר, ישוריין הכלי המוזמן ויתבצעו כל ההכנות למסירתו למזמין, כמו כן יגבה מהמזמין תשלום עבור היום הראשון להזמנה, במקרה של ביטול ההזמנה מכל סיבה שהיא לא יוחזר ללקוח התשלום שנפרע עבור היום הראשון של ההזמנה, גם במקרה של שכירות יומית שהתשלום עבורה נפרע ליום הראשון של העבודה ומסיבה כלשהי הלקוח לא השתמש במושכר או השתמש בצורה חלקית גם במקרה זה לא יוחזר ללקוח התשלום שנגבה עבור היום הראשון והלקוח ישא במלוא העלות של השכירות ליום הראשון.
                            </li>
                        </ol>


                        <li className={classes.liStyleTitle}>
                            מבצע צילום סרטוני כלי עבודה מהשכרה
                        </li>
                        <ol className={`${classes.olStyle} ${classes.innerIndent1}`}>
                            <li className={classes.liStyle}>
                                שליחת סרטון מהווה השתתפות במבצע, בכך מוותר השולח ו/או כל מי שמופיע בסרטון על כל תמורה ומודע לכך שהסרטון עשוי להופיע בפרסומים ובמדיות של החנות כגון אתרי אינטרנט, ערוצי יוטיוב או בכל מקורות אחרים ו/או אצל עסקים ומדיות אחרים הקשורים אל החנות בצורה ישירה או עקיפה.
                            </li>
                        </ol>

                    </ol>

                </Container>
            </Typography>


        </MainComponentContainer >
    );
}

export default Terms;
